docs/posts/2010-02-18-the-luxury-of-cheap-melancholy.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 25, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Luxury of Cheap Melancholy</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Luxury of Cheap Melancholy</h1>
<p class="subtitle" role="doc-subtitle">Feb 18, 2010</p>
</header><p>
Every February, Oklahoma Baptist University celebrates Founders&rsquo; Day with a special chapel service. This year&rsquo;s service was particularly special, commemorating the 100th anniversary of the school&rsquo;s founding. The service included a reenactment of W.P. Blake and G. Lee Phelps kneeling in prayer on the site in Shawnee, Oklahoma that was to become Oklahoma Baptist University.
</p>

<p>
To be honest, I can now remember only a single sentence from either prayer, but it is a sentence that I don&rsquo;t think I will ever forget: <i>&ldquo;Deliver us from the luxury of cheap melancholy.&rdquo;</i>
</p>

<p>
These words may be more relevant now than they were at the time of the founding of OBU. We find ourselves struggling to recover from a recession, embroiled in two wars, worried about the future of the environment, and burdened by spiraling health care costs. Melancholy, or depression, seems to be an unavoidable response. As Phelps said, though, it is both cheap and luxurious; cheap because it costs us nothing, and luxurious because it prevents us from doing what is truly costly. Giving in to the luxury of cheap melancholy is an acceptance of the status quo, an admission that we will simply do nothing.
</p>

<p>
The alternative is to remember who we are and what God has called us to be, people of hope and grace. I was reminded of this as I witnessed a baptism at church on Sunday. In our church, before the baptismal candidate leaves the water, she places a finger in a bowl of salt and then touches the salt to her tongue. She then receives a candle, which she carries out of the baptistry. We who are witnesses are reminded that we too are called to be salt and light, to reject the luxury of cheap melancholy, and go into the world believing that we can, by the grace of God, make things better.
</p>

<p>
May it be so.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 25, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
